{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "relu1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "relu1", "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "maxpool_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "maxpool_pad", "inbound_nodes": [[["relu1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "maxpool", "inbound_nodes": [[["maxpool_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer1.0.conv1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer1.0.conv1_pad", "inbound_nodes": [[["maxpool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer1.0.conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer1.0.conv1", "inbound_nodes": [[["layer1.0.conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer1.0.bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer1.0.bn1", "inbound_nodes": [[["layer1.0.conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer1.0.relu1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer1.0.relu1", "inbound_nodes": [[["layer1.0.bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer1.0.conv2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer1.0.conv2_pad", "inbound_nodes": [[["layer1.0.relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer1.0.conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer1.0.conv2", "inbound_nodes": [[["layer1.0.conv2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer1.0.bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer1.0.bn2", "inbound_nodes": [[["layer1.0.conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "layer1.0.add", "trainable": true, "dtype": "float32"}, "name": "layer1.0.add", "inbound_nodes": [[["maxpool", 0, 0, {}], ["layer1.0.bn2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer1.0.relu2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer1.0.relu2", "inbound_nodes": [[["layer1.0.add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer1.1.conv1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer1.1.conv1_pad", "inbound_nodes": [[["layer1.0.relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer1.1.conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer1.1.conv1", "inbound_nodes": [[["layer1.1.conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer1.1.bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer1.1.bn1", "inbound_nodes": [[["layer1.1.conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer1.1.relu1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer1.1.relu1", "inbound_nodes": [[["layer1.1.bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer1.1.conv2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer1.1.conv2_pad", "inbound_nodes": [[["layer1.1.relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer1.1.conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer1.1.conv2", "inbound_nodes": [[["layer1.1.conv2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer1.1.bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer1.1.bn2", "inbound_nodes": [[["layer1.1.conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "layer1.1.add", "trainable": true, "dtype": "float32"}, "name": "layer1.1.add", "inbound_nodes": [[["layer1.0.relu2", 0, 0, {}], ["layer1.1.bn2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer1.1.relu2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer1.1.relu2", "inbound_nodes": [[["layer1.1.add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer2.0.conv1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer2.0.conv1_pad", "inbound_nodes": [[["layer1.1.relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer2.0.conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer2.0.conv1", "inbound_nodes": [[["layer2.0.conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer2.0.bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer2.0.bn1", "inbound_nodes": [[["layer2.0.conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer2.0.relu1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer2.0.relu1", "inbound_nodes": [[["layer2.0.bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer2.0.conv2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer2.0.conv2_pad", "inbound_nodes": [[["layer2.0.relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer2.0.downsample.0", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer2.0.downsample.0", "inbound_nodes": [[["layer1.1.relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer2.0.conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer2.0.conv2", "inbound_nodes": [[["layer2.0.conv2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer2.0.downsample.1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer2.0.downsample.1", "inbound_nodes": [[["layer2.0.downsample.0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer2.0.bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer2.0.bn2", "inbound_nodes": [[["layer2.0.conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "layer2.0.add", "trainable": true, "dtype": "float32"}, "name": "layer2.0.add", "inbound_nodes": [[["layer2.0.downsample.1", 0, 0, {}], ["layer2.0.bn2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer2.0.relu2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer2.0.relu2", "inbound_nodes": [[["layer2.0.add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer2.1.conv1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer2.1.conv1_pad", "inbound_nodes": [[["layer2.0.relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer2.1.conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer2.1.conv1", "inbound_nodes": [[["layer2.1.conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer2.1.bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer2.1.bn1", "inbound_nodes": [[["layer2.1.conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer2.1.relu1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer2.1.relu1", "inbound_nodes": [[["layer2.1.bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer2.1.conv2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer2.1.conv2_pad", "inbound_nodes": [[["layer2.1.relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer2.1.conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer2.1.conv2", "inbound_nodes": [[["layer2.1.conv2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer2.1.bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer2.1.bn2", "inbound_nodes": [[["layer2.1.conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "layer2.1.add", "trainable": true, "dtype": "float32"}, "name": "layer2.1.add", "inbound_nodes": [[["layer2.0.relu2", 0, 0, {}], ["layer2.1.bn2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer2.1.relu2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer2.1.relu2", "inbound_nodes": [[["layer2.1.add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer3.0.conv1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer3.0.conv1_pad", "inbound_nodes": [[["layer2.1.relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer3.0.conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer3.0.conv1", "inbound_nodes": [[["layer3.0.conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer3.0.bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer3.0.bn1", "inbound_nodes": [[["layer3.0.conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer3.0.relu1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer3.0.relu1", "inbound_nodes": [[["layer3.0.bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer3.0.conv2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer3.0.conv2_pad", "inbound_nodes": [[["layer3.0.relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer3.0.downsample.0", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer3.0.downsample.0", "inbound_nodes": [[["layer2.1.relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer3.0.conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer3.0.conv2", "inbound_nodes": [[["layer3.0.conv2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer3.0.downsample.1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer3.0.downsample.1", "inbound_nodes": [[["layer3.0.downsample.0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer3.0.bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer3.0.bn2", "inbound_nodes": [[["layer3.0.conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "layer3.0.add", "trainable": true, "dtype": "float32"}, "name": "layer3.0.add", "inbound_nodes": [[["layer3.0.downsample.1", 0, 0, {}], ["layer3.0.bn2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer3.0.relu2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer3.0.relu2", "inbound_nodes": [[["layer3.0.add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer3.1.conv1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer3.1.conv1_pad", "inbound_nodes": [[["layer3.0.relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer3.1.conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer3.1.conv1", "inbound_nodes": [[["layer3.1.conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer3.1.bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer3.1.bn1", "inbound_nodes": [[["layer3.1.conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer3.1.relu1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer3.1.relu1", "inbound_nodes": [[["layer3.1.bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer3.1.conv2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer3.1.conv2_pad", "inbound_nodes": [[["layer3.1.relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer3.1.conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer3.1.conv2", "inbound_nodes": [[["layer3.1.conv2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer3.1.bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer3.1.bn2", "inbound_nodes": [[["layer3.1.conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "layer3.1.add", "trainable": true, "dtype": "float32"}, "name": "layer3.1.add", "inbound_nodes": [[["layer3.0.relu2", 0, 0, {}], ["layer3.1.bn2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer3.1.relu2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer3.1.relu2", "inbound_nodes": [[["layer3.1.add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer4.0.conv1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer4.0.conv1_pad", "inbound_nodes": [[["layer3.1.relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer4.0.conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer4.0.conv1", "inbound_nodes": [[["layer4.0.conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer4.0.bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer4.0.bn1", "inbound_nodes": [[["layer4.0.conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer4.0.relu1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer4.0.relu1", "inbound_nodes": [[["layer4.0.bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer4.0.conv2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer4.0.conv2_pad", "inbound_nodes": [[["layer4.0.relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer4.0.downsample.0", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer4.0.downsample.0", "inbound_nodes": [[["layer3.1.relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer4.0.conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer4.0.conv2", "inbound_nodes": [[["layer4.0.conv2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer4.0.downsample.1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer4.0.downsample.1", "inbound_nodes": [[["layer4.0.downsample.0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer4.0.bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer4.0.bn2", "inbound_nodes": [[["layer4.0.conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "layer4.0.add", "trainable": true, "dtype": "float32"}, "name": "layer4.0.add", "inbound_nodes": [[["layer4.0.downsample.1", 0, 0, {}], ["layer4.0.bn2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer4.0.relu2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer4.0.relu2", "inbound_nodes": [[["layer4.0.add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer4.1.conv1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer4.1.conv1_pad", "inbound_nodes": [[["layer4.0.relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer4.1.conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer4.1.conv1", "inbound_nodes": [[["layer4.1.conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer4.1.bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer4.1.bn1", "inbound_nodes": [[["layer4.1.conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer4.1.relu1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer4.1.relu1", "inbound_nodes": [[["layer4.1.bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "layer4.1.conv2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "layer4.1.conv2_pad", "inbound_nodes": [[["layer4.1.relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer4.1.conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "untruncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer4.1.conv2", "inbound_nodes": [[["layer4.1.conv2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer4.1.bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer4.1.bn2", "inbound_nodes": [[["layer4.1.conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "layer4.1.add", "trainable": true, "dtype": "float32"}, "name": "layer4.1.add", "inbound_nodes": [[["layer4.0.relu2", 0, 0, {}], ["layer4.1.bn2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer4.1.relu2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer4.1.relu2", "inbound_nodes": [[["layer4.1.add", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "avgpool", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "avgpool", "inbound_nodes": [[["layer4.1.relu2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc", "trainable": true, "dtype": "float32", "units": 1000, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.044194173824159216, "maxval": 0.044194173824159216, "seed": null}, "shared_object_id": 187}, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.044194173824159216, "maxval": 0.044194173824159216, "seed": null}, "shared_object_id": 187}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc", "inbound_nodes": [[["avgpool", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["fc", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of12.bin", "group1-shard2of12.bin", "group1-shard3of12.bin", "group1-shard4of12.bin", "group1-shard5of12.bin", "group1-shard6of12.bin", "group1-shard7of12.bin", "group1-shard8of12.bin", "group1-shard9of12.bin", "group1-shard10of12.bin", "group1-shard11of12.bin", "group1-shard12of12.bin"], "weights": [{"name": "bn1/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn1/beta", "shape": [64], "dtype": "float32"}, {"name": "bn1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv1/kernel", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1000, 3], "dtype": "float32"}, {"name": "dense/bias", "shape": [3], "dtype": "float32"}, {"name": "fc/kernel", "shape": [512, 1000], "dtype": "float32"}, {"name": "fc/bias", "shape": [1000], "dtype": "float32"}, {"name": "layer1.0.bn1/gamma", "shape": [64], "dtype": "float32"}, {"name": "layer1.0.bn1/beta", "shape": [64], "dtype": "float32"}, {"name": "layer1.0.bn1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "layer1.0.bn1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "layer1.0.bn2/gamma", "shape": [64], "dtype": "float32"}, {"name": "layer1.0.bn2/beta", "shape": [64], "dtype": "float32"}, {"name": "layer1.0.bn2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "layer1.0.bn2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "layer1.0.conv1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "layer1.0.conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "layer1.1.bn1/gamma", "shape": [64], "dtype": "float32"}, {"name": "layer1.1.bn1/beta", "shape": [64], "dtype": "float32"}, {"name": "layer1.1.bn1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "layer1.1.bn1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "layer1.1.bn2/gamma", "shape": [64], "dtype": "float32"}, {"name": "layer1.1.bn2/beta", "shape": [64], "dtype": "float32"}, {"name": "layer1.1.bn2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "layer1.1.bn2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "layer1.1.conv1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "layer1.1.conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "layer2.0.bn1/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer2.0.bn1/beta", "shape": [128], "dtype": "float32"}, {"name": "layer2.0.bn1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "layer2.0.bn1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "layer2.0.bn2/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer2.0.bn2/beta", "shape": [128], "dtype": "float32"}, {"name": "layer2.0.bn2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "layer2.0.bn2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "layer2.0.conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "layer2.0.conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "layer2.0.downsample.0/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "layer2.0.downsample.1/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer2.0.downsample.1/beta", "shape": [128], "dtype": "float32"}, {"name": "layer2.0.downsample.1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "layer2.0.downsample.1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "layer2.1.bn1/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer2.1.bn1/beta", "shape": [128], "dtype": "float32"}, {"name": "layer2.1.bn1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "layer2.1.bn1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "layer2.1.bn2/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer2.1.bn2/beta", "shape": [128], "dtype": "float32"}, {"name": "layer2.1.bn2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "layer2.1.bn2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "layer2.1.conv1/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "layer2.1.conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "layer3.0.bn1/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer3.0.bn1/beta", "shape": [256], "dtype": "float32"}, {"name": "layer3.0.bn1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "layer3.0.bn1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "layer3.0.bn2/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer3.0.bn2/beta", "shape": [256], "dtype": "float32"}, {"name": "layer3.0.bn2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "layer3.0.bn2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "layer3.0.conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "layer3.0.conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "layer3.0.downsample.0/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "layer3.0.downsample.1/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer3.0.downsample.1/beta", "shape": [256], "dtype": "float32"}, {"name": "layer3.0.downsample.1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "layer3.0.downsample.1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "layer3.1.bn1/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer3.1.bn1/beta", "shape": [256], "dtype": "float32"}, {"name": "layer3.1.bn1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "layer3.1.bn1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "layer3.1.bn2/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer3.1.bn2/beta", "shape": [256], "dtype": "float32"}, {"name": "layer3.1.bn2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "layer3.1.bn2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "layer3.1.conv1/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "layer3.1.conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "layer4.0.bn1/gamma", "shape": [512], "dtype": "float32"}, {"name": "layer4.0.bn1/beta", "shape": [512], "dtype": "float32"}, {"name": "layer4.0.bn1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "layer4.0.bn1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "layer4.0.bn2/gamma", "shape": [512], "dtype": "float32"}, {"name": "layer4.0.bn2/beta", "shape": [512], "dtype": "float32"}, {"name": "layer4.0.bn2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "layer4.0.bn2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "layer4.0.conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "layer4.0.conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "layer4.0.downsample.0/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "layer4.0.downsample.1/gamma", "shape": [512], "dtype": "float32"}, {"name": "layer4.0.downsample.1/beta", "shape": [512], "dtype": "float32"}, {"name": "layer4.0.downsample.1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "layer4.0.downsample.1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "layer4.1.bn1/gamma", "shape": [512], "dtype": "float32"}, {"name": "layer4.1.bn1/beta", "shape": [512], "dtype": "float32"}, {"name": "layer4.1.bn1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "layer4.1.bn1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "layer4.1.bn2/gamma", "shape": [512], "dtype": "float32"}, {"name": "layer4.1.bn2/beta", "shape": [512], "dtype": "float32"}, {"name": "layer4.1.bn2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "layer4.1.bn2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "layer4.1.conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "layer4.1.conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}]}]}